benchmarks/casesOF/2D/parasiticRipples/N400/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

application=$(getApplication)

restore0Dir
runApplication blockMesh
for lvl in 0 1
do
    runApplication topoSet -dict system/topoSetDict.c"$lvl"
    mv log.topoSet log.topoSet.c"$lvl"
    runApplication refineMesh -overwrite -dict system/refineMeshDict.c"$lvl"
    mv log.refineMesh log.refineMesh.c"$lvl"
done
runApplication setWaveField

runApplication decomposePar
runParallel ${application}

#------------------------------------------------------------------------------
